package oldClassWork;

public class Main {
    public static void main(String[] args) {
        int a = 9;
        double b = 2.0;
        char c = '&';
        boolean isActive = true;
        String hello = "Hello World!";
        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        System.out.println(isActive);
        System.out.println(hello);
        int x = 9;
        System.out.println(a+x);
        System.out.println(a-x);
        System.out.println(a*x);
        System.out.println(a/b);
        System.out.println(a%b);
        if (a>x){
            System.out.println("A>");
        } else if (a<x){
            System.out.println("X>");
        } else {
            System.out.println("=");
        }
        // < - строго меньше
        /* > - строго больше
        <= - меньше или ровно
        >= - больше или ровно
        == - ровно
        != - не ровно
        && - and
        || - or


        //Тернарный оператор
        int x = 1;
        int y = 2;
        int z = x<y? (x+y) : (x-y);
        //[первый операнд - условие] ? [второй операнд] : [третий операнд].
         */

        //1.    Вывести на консоль последовательность чисел: 1 2 4 8 16 32 64 128 256 512
        //2.    Вывести на консоль последовательность чисел: 7 14 21 28 35 42 49 56 63 70 77 84 91 98
















    }





}