package OLD;

/*
Дано несколько чисел. Вычислите их сумму. Сначала вводите количество чисел N, затем вводится ровно N целых чисел.
Какое наименьшее число переменных нужно для решения этой задачи.
*/
public class HomeWork5 {
    public static void main(String[] args) {
        int a = 7;
        int b = 8;
        int sum = 0;
        for (int i = 1; i <= a; ++i) {
            sum = sum + b;

        }
        System.out.println(+sum);
    }
}